Revit 2027 API
BuiltInFailures.SiteFailures.GradeRegionElementsIngoreBottom Property
 The current grading element has different elevations on bottom faces with existing element, however the cut/fill volume calculation will ignore the bottom faces differences.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GradeRegionElementsIngoreBottom { get; }
Public Shared ReadOnly Property GradeRegionElementsIngoreBottom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GradeRegionElementsIngoreBottom {
	FailureDefinitionId^ get ();
}
static member GradeRegionElementsIngoreBottom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace